{"format": "layers-model", "generatedBy": "keras v3.10.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.10.0", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 40, 44, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}}, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 40, 44, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 19, 21, 32]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 8, 9, 64]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "data_format": "channels_last"}, "build_config": {"input_shape": [null, 3, 3, 128]}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 1152]}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 138608569915760}, "units": 30, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 128]}}], "build_input_shape": [null, 40, 44, 1]}, "build_config": {"input_shape": [null, 40, 44, 1]}, "compile_config": {"optimizer": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "layers/conv2d/vars/0", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "layers/conv2d/vars/1", "shape": [32], "dtype": "float32"}, {"name": "layers/conv2d_1/vars/0", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "layers/conv2d_1/vars/1", "shape": [64], "dtype": "float32"}, {"name": "layers/conv2d_2/vars/0", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "layers/conv2d_2/vars/1", "shape": [128], "dtype": "float32"}, {"name": "layers/dense/vars/0", "shape": [1152, 128], "dtype": "float32"}, {"name": "layers/dense/vars/1", "shape": [128], "dtype": "float32"}, {"name": "layers/dense_1/vars/0", "shape": [128, 30], "dtype": "float32"}, {"name": "layers/dense_1/vars/1", "shape": [30], "dtype": "float32"}, {"name": "optimizer/vars/0", "shape": [], "dtype": "int32"}, {"name": "optimizer/vars/1", "shape": [], "dtype": "float32"}, {"name": "optimizer/vars/10", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "optimizer/vars/11", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "optimizer/vars/12", "shape": [128], "dtype": "float32"}, {"name": "optimizer/vars/13", "shape": [128], "dtype": "float32"}, {"name": "optimizer/vars/14", "shape": [1152, 128], "dtype": "float32"}, {"name": "optimizer/vars/15", "shape": [1152, 128], "dtype": "float32"}, {"name": "optimizer/vars/16", "shape": [128], "dtype": "float32"}, {"name": "optimizer/vars/17", "shape": [128], "dtype": "float32"}, {"name": "optimizer/vars/18", "shape": [128, 30], "dtype": "float32"}, {"name": "optimizer/vars/19", "shape": [128, 30], "dtype": "float32"}, {"name": "optimizer/vars/2", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "optimizer/vars/20", "shape": [30], "dtype": "float32"}, {"name": "optimizer/vars/21", "shape": [30], "dtype": "float32"}, {"name": "optimizer/vars/3", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "optimizer/vars/4", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/5", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/6", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "optimizer/vars/7", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "optimizer/vars/8", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/9", "shape": [64], "dtype": "float32"}]}]}